Revit 2026 API

# AlphanumericRevisionSettingsIsEqual Method

---

Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEqual(
	AlphanumericRevisionSettings other
)
```
```vb
Public Function IsEqual (
	other As AlphanumericRevisionSettings
) As Boolean
```
```cpp
public:
bool IsEqual(
	AlphanumericRevisionSettings^ other
)
```
```fsharp
member IsEqual :
        other : AlphanumericRevisionSettings -> bool
```

#### Parameters

other AlphanumericRevisionSettings
     The AlphanumericRevisionSettings object to be compared with 'this'.

#### Return Value

Boolean True, if two AlphanumericRevisionSettings are the same.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The two AlphanumericRevisionSettings are regarded as the same only if they have the same revision numbering sequence, and the same prefix and suffix strings.

#### Reference

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace